public/signed.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
            <soapenv:Header/>
            <soapenv:Body><RegisterInvoiceRequest xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="https://efi.tax.gov.me/fs/schema" Id="Request" Version="1">
    <Header SendDateTime="2021-04-30T18:33:25+02:00" UUID="f75babe9-6d72-40df-89b1-f35909d76440"/>

    <Invoice TypeOfInv="CASH" IsSimplifiedInv="false" IssueDateTime="2021-04-30T18:33:25+02:00" InvNum="xx123xx123/26/2021/si747we972" InvOrdNum="26" TCRCode="si747we972" IsIssuerInVAT="true" TotPriceWoVAT="99.17" TotVATAmt="20.83" TotPrice="120.00" OperatorCode="oo123oo123" BusinUnitCode="xx123xx123" SoftCode="ss123ss123" IIC="ef42c57f4d2fcdbe3d3b3a6647cb2bb7" IICSignature="22677703539733cce036831c86e7fed05846557b2c2a312529768ae858f660e87c5e9db5853cc476e1156fcd3571040d1a457baec980990961517473177854790305166c8a58d720810123480c0ed96b8eeab4387f4be2ad4b78e675e1d7b9659893ea31b796c1e6d9772a903b925ad300e4acf81ab2df7256e6a842920cd81fd901581504c1bc4f83c9dd3b984ec962477d1c56a447cc2e8e50d1064688693272b589d41eacea2a20bf31f3b6830946c971f6c37a5e1b08b73ab33f5e6045f9c49c8d2ff859a2a8b7fdc58951130a04f3840b8e95abf12a91e782aba8bd7e757e244d74e1608f220fbb5ce3d60e2caabd760b5d0dab19af2afda48d630d1217" IsReverseCharge="false">
        <PayMethods>
            <PayMethod Type="BANKNOTE" Amt="120.00"/>
        </PayMethods>

        <Seller IDType="TIN" IDNum="12345678" Name="Nex Montenegro"/>

        <Buyer IDType="TIN" IDNum="12345678" Name="Anonimni Kupac"/>

        <Items>
                            <I N="quisquam" C="0" U="sek" Q="12.00" UPB="8.26" UPA="10.00" R="0.00" RR="1" PB="99.17" VR="0.00" VA="1.74" PA="120.00"/>
                    </Items>


        <SameTaxes>
                                                <SameTax NumOfItems="12" PriceBefVAT="1190.09" VATRate="0.00" VATAmt="20.83"/>
                                                                                            </SameTaxes>
    </Invoice>
<Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
  <SignedInfo><CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
    <SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#rsa-sha256"/>
  <Reference URI="#Request"><Transforms><Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></Transforms><DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/><DigestValue>kKh/GdZWWznojSTV3K+U3gHSN9J/y3q9bJWWhYij778=</DigestValue></Reference></SignedInfo><SignatureValue>Tl901kmVYxhKlgydhqAtrwRg/wgYgyZxqhq6AByDgMaJrDH7aw+AmPSgVQ1KyGR84OtGsfEj0DaOwPiSEB/hdGkTKpgQ3SbcXtbHF6BMkfoCbq+dsTyiqKkwD6QPzk6GTdBliFlkzpt4vHQXWNuwQGHy4/WbwYtRp9/Gx6g73FYXl9idcW3BBAbXBZYJtEyuP1W//wX/0uD+yqijEzHpzvJmBnCoOqM94dd9e7RDNCmlXjKjSuF9SEWefosbqF8mCk1Gs49LnEAa92GRtyFag7RRA2o69L/soJk6p1Qqbd7X9PtmNs86iZ3EyiwYo+12lJSYpMrx8umPPqME5zJeLg==</SignatureValue>
<KeyInfo><X509Data><X509Certificate>MIIFoDCCBAigAwIBAgIIAosoHBIRrfUwDQYJKoZIhvcNAQELBQAwTzELMAkGA1UE
BhMCTUUxDzANBgNVBAoMBkNvcmVpdDEXMBUGA1UEYQwOVkFUTUUtMDI3NzUwMTgx
FjAUBgNVBAMMDUNvcmVpdCBTdWIgQ0EwHhcNMjAxMDA1MTIxNDQ3WhcNMjMxMDA1
MTIxNDQ3WjCBmzELMAkGA1UEBhMCTUUxGjAYBgNVBAoMEVRlc3QgT25seSBDb21w
YW55MRcwFQYDVQRhDA5WQVRNRS0xMjM0NTY3ODESMBAGA1UECwwJT3BlcmFjaWpl
MQ4wDAYDVQQFEwUxMDAwMTEzMDEGA1UEAwwqVGVzdCBPbmx5IENvbXBhbnkgKFBl
xI1hdC9BdXRlbnRpZmlrYWNpamEpMIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIB
CgKCAQEAqzK8vMGchz7qc5K7eqvLy3kMIO7omEv406wLU+vIMIeusmwebrVYCd03
EdMrI6ktDFiUuQbD1Ze0+oxpBLT9iFpB3njTf+z2phI5BNkEseHGxc0BrT8S2DTG
qO13xAYwcqViK6cARfpgzpRB6B1HLVKmW5PwlwNQlmXuM61bQqyaPLrToNex+drV
ybO9r2zLQzY5ztNV5F1Uy/pQnggZt2qRyFO71cW/D7+Vc1d14DGG4gy3TmW36BQK
3zSGBy11psNLLsNDPl14JaqrKZgKv9o6M9+qZ0yb08HHoURkR91XsbJ0YnUZJy+D
jy6rya7iqqN5y5MIc9qfdul7HI/FuQIDAQABo4IBsTCCAa0wDAYDVR0TAQH/BAIw
ADAfBgNVHSMEGDAWgBRS3xfznifJOu61Gx/QkwDS8wtU/jBxBggrBgEFBQcBAQRl
MGMwLwYIKwYBBQUHMAKGI2h0dHA6Ly9jYS5jb3JlaXQubWUvQ29yZWl0U3ViQ0Eu
Y2VyMDAGCCsGAQUFBzABhiRodHRwOi8vb2NzcC5jYS5jb3JlaXQubWUvQ29yZWl0
U3ViQ0EwQgYDVR0gBDswOTA3Bg0rBgEEAYOjKQEBAgIBMCYwJAYIKwYBBQUHAgEW
GGh0dHA6Ly9jYS5jb3JlaXQubWUvY3BzLzBcBggrBgEFBQcBAwRQME4wCAYGBACO
RgEBMBMGBgQAjkYBBjAJBgcEAI5GAQYCMC0GBgQAjkYBBTAjMCEWG2h0dHBzOi8v
Y2EuY29yZWl0Lm1lL3Bkcy9lbhMCZW4wOAYDVR0fBDEwLzAtoCugKYYnaHR0cDov
L2NybC5jYS5jb3JlaXQubWUvQ29yZWl0U3ViQ0EuY3JsMB0GA1UdDgQWBBSLBPEd
crmjuxuatJAJ3dUzJmzzbjAOBgNVHQ8BAf8EBAMCBsAwDQYJKoZIhvcNAQELBQAD
ggGBACp0Yi52FnYapjzVv//lC17uU6EKrIomCs1QUQSQE7zXrz4pBgnB3v4mNS1g
0EzFtzfkIspjQex1Y8D/SdgtFrVmwfmUhsI/GLtr1VvlSVTMdRoekGDHS8J89wna
rebV3pxfIFpmKw3iqQwIQXur5gXCRojPehJoAg3J/YhA1XT6D0aEYJVhRjIuSqee
c/G7XIDKnr8sOy+iOBaHVjvnQ5cYmXgVyslDuWFZ7N5mRrWYreXX+WaOAQf1+zEq
BsRwZp7jAU62dmI4D4C/FqrANhOby6FKOjCylX7VrF3igZyQ+KHVETSxqJXMTyQ9
uBRZ/G+lubDfjGVlcwznQLPpo3VFpExIvS8Ne/5M1KJjBcVhzc2lPC5ObIyu+Tex
IYNvuj2FwRs9xLGAwkO0LMJNfjYPItWhBoHZej3SUScgBGtI6p9n8xFrMly93tAJ
+GhBX4Wncz3TAUhkhH8jPvJUJVYil1QGToOCBIp/XD76BbF67Q/DStDSCeU68CqS
oTQLMw==
</X509Certificate></X509Data></KeyInfo></Signature></RegisterInvoiceRequest>
</soapenv:Body>
            </soapenv:Envelope>